# # 출력

# # print(출력1,출력2,...)

# # 현재 무엇을 하는지 알 수 있도록 메세지를 출력하는 파이썬의
# # 기본 출력 방법

# print(906)

# # 터미널 

# # 출력을 받기 위한 장치 

# # 실행 -> Ctrl + F5

# # 문자열 출력 -> 따옴표 사용
# print("9월6일")
# print('9월6일')

# # 숫자 출력
# print(999)

# # 줄바꿈
# print()

# # 숫자 연산 결과
# print(9+9)

# # 하나만 출력하기
# print('HI')

# # 여러개 출력하기 -> ,사용
# print('HI',906,"BYE",'9월6일',9+6)

# #예제1
# print('10더하기20은',10+20)

# #예제2
# print('10곱하기20은',10*20)


# # 문제(이름,전화번호,이메일,주소)

# print("=========================================================================")
# print("=========================================================================")
# print("=========================================================================")
# print("=================================== name : kim hye lin ==================")
# print("=================================== call : 010 - 1234 - 5678 ============")
# print("=================================== email : apeach_9@naver.com ==========")
# print("=================================== address : 서울시 종로구 묘동 56 =====")
# print("=========================================================================")
# print("=                                                                       =")
# print("=                                                                       =")
# print("=========================================================================")
# print("=========================================================================")

# # 구문 에러
# # SyntaxError: '(' was never closed
# # SyntaxError: unterminated string literal (detected at line 49)

# # 들여쓰기 에러
# # IndentationError: unexpected indent

# # 예제3
# print("Uncle's present")

# # 예제4
# print('Uncle\'s present')

# # 이스케이프 문자

# #1.\n
# print("다음라인으로")
# print("이동")
# print()
# print("다음라인으로\n이동")

# #2.\t
# print("Tab은   공백")
# print("Tab은\t공백")

# #3.\',\",\\문자
# print("\',\",\\문자 사용하는 방법")


# # end옵션

# # 줄바꿈 대신 코드를 이어서 출력하기 위해 사용

# print("Welcome to")
# print("IT News")
# print("Web site")
# print()
# print("Welcome to",end=" ")
# print("IT News",end=' ')
# print("Web site")
# print()
# print("Welcome to",end="   ^   ")
# print("IT News",end='   *   ')
# print("Web site")

# print("안녕하세요") 

# 주석

# 프로그램 코드 내에 설명문을 넣기 위해 사용

# 한 줄 주석 -> 앞에 # 사용

# 한 줄 주석

# 여러줄 주석 -> 시작점과 끝점에 따옴표3개 사용

'''여
러
줄
주
석'''


# # 꿀팁

# print("Welcome to")
# print("IT News")
# print("Web site")


'''print("Welcome to")
print("IT News")
print("Web site")'''

# # 문제
# print("\t #### 회비정보 ####")
# print("="*40)
# print("이름\t나이\t전화번호\t회비")
# print("========================================")
# print("김동완\t38\t010-1111-1111\t\\20,000")
# print("서지수\t24\t010-1234-5678\t\\30,000")
# print("이지은\t25\t010-2525-2345\t\\50,000")
# print('-'*40)
# print("총합계\t\t\t\t\\100,000")
# print("="*40)


# # 진법 변환

# # 10진수값 : 100

# # 2진수 -> bin()
# print(bin(100))

# # 8진수 -> oct()
# print(oct(100))

# # 16진수 -> hex()
# print(hex(100))

# # 2진수 -> 10진수 0b
# print(0b1100100)

# # 8진수 -> 10진수 0o
# print(0o144)

# # 16진수 -> 10진수 0x
# print(0x64)

# #예제1
# print(hex(200))

# #예제2
# print(oct(245))

# #예제3
# print(0b1101010001110001)

# #예제4
# print(0x3D5F)

# 대면 (공유폴더)

# 1. win + r 입력

# 2. \\192.168.43.22 입력

# 3. 9월 파이썬 기초 폴더 클릭
# => 공유폴더 파일을 자료 파일로 *****복 붙***** 

# 4. 자신의 이메일로 자료첨부
# (USB)

# 5. ppt 삭제, 컴퓨터 종료 
